# Данные
students_data = [
    {"name": "Иван", "grades": {"Математика": [4, 5, 3, 4, 5], "Физика": [3, 4, 3, 5, 4], "Информатика": [3, 4, 4, 5, 3]}},
    {"name": "Георгий", "grades": {"Математика": [5, 4, 4, 5, 5], "Физика": [3, 3, 4, 5, 5], "Информатика": [4, 4, 4, 5, 4]}},
    {"name": "Светлана", "grades": {"Математика": [4, 4, 4, 3, 4], "Физика": [4, 3, 4, 5, 5], "Информатика": [4, 4, 5, 5, 4]}},
    {"name": "Петр", "grades": {"Математика": [3, 3, 4, 4, 3], "Физика": [5, 5, 4, 4, 5], "Информатика": [5, 5, 4, 4, 5]}},
    {"name": "Ирина", "grades": {"Математика": [5, 5, 5, 4, 5], "Физика": [5, 3, 4, 5, 3], "Информатика": [3, 4, 4, 3, 4]}},
    {"name": "Галина", "grades": {"Математика": [4, 5, 4, 3, 4], "Физика": [3, 4, 3, 4, 4], "Информатика": [4, 4, 4, 4, 4]}},
]

# Создаем словарь для хранения средних баллов
average_grades = {}

# Вычисляем средний балл для каждого ученика по предметам
for student in students_data:
    name = student["name"]
    grades = student["grades"]

    # Вычисляем средний балл по каждому предмету
    average_grades[name] = {
        "Математика": sum(grades["Математика"]) / len(grades["Математика"]),
        "Физика": sum(grades["Физика"]) / len(grades["Физика"]),
        "Информатика": sum(grades["Информатика"]) / len(grades["Информатика"])
    }

# Выводим результат
for student, grades in average_grades.items():
    print(f"{student}: {grades}")
    print('good')